# Напишите функцию принимающую на вход только ключевые параметры и возвращающую словарь, где ключ — значение переданного аргумента, а значение — имя аргумента.
# Если ключ не хешируем, используйте его строковое представление.



def slovar(*, a, b):
    for i in b_1:
        {b[i] : a[i]}
        
    return {b : a}



a_1, *_ = input('Enter a nember and a value separated by a space: ').split()
b_1, *_ = input('Enter a nember and a value separated by a space: ').split()
# print(c, *_)
print(slovar(a=a_1, b=b_1))